# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости,
#  в которой находится эта точка .
# Пример:
# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

x = float(input('Введите координату Х: '))
y = float(input('Введите координату Y: '))

if( x > 0 and y > 0 ):
    print('Это первая четверть')
elif ( x < 0 and y > 0 ):
    print('Это вторая четверть')
elif ( x < 0 and y < 0 ):
    print('Это третья четверть')
elif ( x > 0 and y < 0 ):
    print('Это четвертая четверть')
else:
    print('Точка находится на координатной оси ')    